# TODO

## ログイン
[https://github.com/sh-okada/practice-tdd/issues/1](https://github.com/sh-okada/practice-tdd/issues/1)

```
要件
メールアドレスとパスワードでログインできる。
パスワードは入力内容をマスクし、任意で表示できるようにする。

ログインの検証は /api/auth/login で行う。ログインに成功した場合は / に遷移し、ログインに失敗した場合はエラーメッセージを表示する。

また、すでにログインしている場合は / にリダイレクトさせること。
```

### 要求分割
- パスワードは入力内容をマスクする
- パスワードはマスク状態を切り替えできる
- APIでログインする
- ログインに成功すると / に遷移する
- ログインに失敗するとエラーメッセージを表示する
- すでにログインしているときは / にリダイレクトする

- テスト容易性が低い要因
    - 遷移
    - リダイレクト
    - API

### テスト容易性を高くする
